[{"Title":"National Hot Cross Buns - Lunch","Date":"2023-09-11","Description":"Clark Bakery Hot Cross Buns during lunch. Check our hours of operations online at https://dining.unt.edu/hours/."},{"Title":"Cartoon Trivia","Date":"2023-09-11","Description":"Put your cartoon knowledge to the test and win cool prizes!"},{"Title":"Pride Support Group","Date":"2023-09-11","Description":"Pride Group is a LGBTQ+ support group that celebrates queerness. We are a space for students to learn tools to live into their queer joy, build nourishing relationships, and..."},{"Title":"Becoming","Date":"2023-09-11","Description":"The goal of this workshop is to provide a safe space for Black women to explore the challenges of navigating adulthood, academic achievement, and societal/familial..."},{"Title":"RecSports Group Fitness Showcase","Date":"2023-09-11","Description":"Join UNT Rec Sports for their annual Group Fitness Showcase on Library Mall. Every 20 minutes, they will showcase a new format, allowing you the chance to try a variety of..."},{"Title":"SOLD Workshops","Date":"2023-09-11","Description":"Looking for an opportunity to take your Student Organization to the next level? Attend Student Organization Leader Development (SOLD) Workshops and learn what it takes to make..."},{"Title":"N/A 12-Step Support Group","Date":"2023-09-11","Description":"Groups members will gain an understanding of the 12-Step program, find a sponsor to work with them to complete the 12 steps of Narcotics Anonymous and discuss their personal..."},{"Title":"SMART recovery group","Date":"2023-09-11","Description":"A mutual support group for participants to design and implement their own substance use or process addiction recovery plan to create a more balanced, purposeful, and..."},{"Title":"Nashville Hot Chicken - Lunch","Date":"2023-09-12","Description":"Texas Toast, Nashville Hot Chicken, and Dill Pickle Slices. Check our hours of operation any time at dining.unt.edu/hours"},{"Title":"CSA Cinema: Dungeons & Dragons: Honor Among Thieves","Date":"2023-09-12","Description":"This quest involves a thief, adventures, a lost relic, and lots of danger. You won't want to miss out on this adventure with us!"},{"Title":"Sleep Well, Be Well","Date":"2023-09-12","Description":"Do you get enough sleep? Stop by to learn about sleep health, create your own sleep kit, and find better ways to sleep!"},{"Title":"Art Therapy Open Studio","Date":"2023-09-12","Description":"Art Therapy Group is a safe place to explore and express feelings, manage stress and anxiety, and explore new art materials. New media will be presented with an intervention..."},{"Title":"WMGF Project Proposal Workshop","Date":"2023-09-12","Description":"Are you passionate about making a positive impact on our environment? Do you have innovative ideas to promote sustainability and address environmental challenges on our..."},{"Title":"National Chocolate Milkshake - Dinner","Date":"2023-09-12","Description":"Chocolate shakes at dinner! Check our hours of operations online at https://dining.unt.edu/hours/."},{"Title":"Arthouse Film Series: Air","Date":"2023-09-12","Description":"This film is based on the true events that led to the creation of Air Jordan basketball shoes!"},{"Title":"Nighttime Tunes","Date":"2023-09-12","Description":"There's no better way to end the day than listening to live music with UPC!"},{"Title":"Career Fair","Date":"2023-09-13","Description":"CAREER FAIR Meet employers and learn about available career opportunities. Sponsored by VFW Post # 2205. All UNT students, Veteran and Non Veteran, are welcome."},{"Title":"Mean Green Screen","Date":"2023-09-13","Description":"Free HIV testing provided by Aids Health Foundation. This test is ONLY for HIV."},{"Title":"Great Expectations","Date":"2023-09-13","Description":"This workshop will highlight the importance of managing academic expectations as students transition from high school to college. This includes understanding the effects our..."},{"Title":"Mentally Prepared","Date":"2023-09-13","Description":"Are you mentally prepared for the school year? Come join the Student Health and Wellness Center, RISE Center, and Counseling and Testing services to participate in activities..."},{"Title":"Mindfulness & Meditation for Mental Health","Date":"2023-09-13","Description":"13-week workshop meeting for 1 hour in which participants will learn and be led in the practice of a technique for meditation and mindfulness and be provided with..."},{"Title":"Flight Days","Date":"2023-09-13","Description":"Take Flight at Frisco Landing with Student Activities and Off-Campus Student Services. Stop by our table to learn how to get involved with programs and services that we offer!"},{"Title":"All Recovery Support Group","Date":"2023-09-13","Description":"All Recovery Support Group is a peer support group where all pathways of recovery are welcome and members can share their experiences of navigating recovery. If you are..."},{"Title":"National Peanut Day","Date":"2023-09-13","Description":"Enjoy a Mean Greens Sriacha Peanut Brittle! Available starting at 1 p.m. until sold out. Check our hours of operations online at https://dining.unt.edu/hours/."},{"Title":"Collegiate Recovery Program weekly board game club","Date":"2023-09-13","Description":"Every wednesday from 1:30pm-2:30 pm UNT students meet at Chestnut hall room 301c in the RISE center and bring in their favorite board game or table top games. Each week we..."},{"Title":"Walking Through Grief","Date":"2023-09-13","Description":"This is a 10 week group meeting in which students will receive psychoeducation on grief, coping skills, and a safe space to process loss with the support from peers. Objective..."},{"Title":"Wellbeing @ Work: Counselor Consultation Hour (Virtual)","Date":"2023-09-13","Description":"Counseling & Testing Services is offering a drop-in hour at the Faculty Lounge for Faculty and Staff to ask questions or consult with a counselor regarding a specific concern..."},{"Title":"Plushie Bingo","Date":"2023-09-13","Description":"Play bingo with your favorite stuffed animal and win more cuties to add to your collection."},{"Title":"National Cream-filled Donut Day - Breakfast","Date":"2023-09-14","Description":"Chef Olivia's Donuts & Coffee Bar at Breakfast! Check our hours of operations online at https://dining.unt.edu/hours/."},{"Title":"Wellbeing @ Work: Counselor Consultation Hour","Date":"2023-09-14","Description":"Counseling & Testing Services is offering a drop-in hour at the Faculty Lounge for Faculty and Staff to ask questions or consult with a counselor regarding a specific concern..."}]